#+TITLE: JSONB
#+AUTHOR: M. Surmashev @muradbei
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+PROPERTY: header-args:sql :engine postgresql :dbport 5400 :dbhost localhost :dbuser postgres :dbpassword postgres :database postgres

** JSON vs JSONB

 - ~JSON~ plain text json
 - ~JSONB~ binary json format
   - All keys unique
   - All keys sorted

*Exmaple:*

=JSON= can containing duplicate keys

  #+name: Cast to JSON
  #+BEGIN_SRC sql
    select '{"name": "Bob", "name": "John"}'::json
  #+END_SRC

  #+RESULTS: Cast to JSON
  | json                            |
  |---------------------------------|
  | {"name": "Bob", "name": "John"} |

=JSONB= replace double key

  #+name: Cast to JSONB
  #+BEGIN_SRC sql
    select '{"name": "Bob", "name": "John"}'::jsonb
  #+END_SRC

  #+RESULTS: Cast to JSONB
  | jsonb            |
  |------------------|
  | {"name": "John"} |

** Create JSONB

  =::JSONB= - cast string as json/jsonb type

  #+BEGIN_SRC sql
    select '{"name": "Bob"}'::JSONB;
  #+END_SRC

  #+RESULTS:
  | jsonb           |
  |-----------------|
  | {"name": "Bob"} |


  =jsonb_build_array= - create json/jsonb contains array

  #+BEGIN_SRC sql
    select jsonb_build_array(1, 2, 3, 'Bob');
  #+END_SRC

  #+RESULTS:
  | jsonb_build_array |
  |-------------------|
  | [1, 2, 3, "Bob"]  |


  =jsonb_build_object= - create json/jsonb object

  #+BEGIN_SRC sql
    select jsonb_build_object('name', 'Bob', 'family', 'Smith');
  #+END_SRC

** Predicates

  =?= - Does the string exist as a top-level key within the JSON value
  #+BEGIN_SRC sql
    select '{"name": "Bob"}'::JSONB ? 'name';
  #+END_SRC

    #+RESULTS:
    | ?column? |
    |----------|
    | t        |

  =@>= - Does the left JSON value contain the right JSON
  #+BEGIN_SRC sql
    select '{"name": "Bob", "family": "Smith"}'::jsonb
	     @> '{"name": "Bob"}'::jsonb ;
  #+END_SRC

   #+RESULTS:
   | ?column? |
   |----------|
   | t        |

** Mutate jsonb

  =||= - Concatenate two jsonb values into a new jsonb value
  #+BEGIN_SRC sql
    select '{"name": "Bob"}'::JSONB || '{"family": "Smith"}'::JSONB;
  #+END_SRC

  #+RESULTS:
  | ?column?                           |
  |------------------------------------|
  | {"name": "Bob", "family": "Smith"} |

  =-= - Delete key/value pair or string element from left operand
  #+BEGIN_SRC sql
    select '{"name": "Bob", "family": "Smith"}'::jsonb - 'name'
  #+END_SRC

  #+RESULTS:
  | ?column?            |
  |---------------------|
  | {"family": "Smith"} |

  =jsonb_set= - Insert new value by path
  #+BEGIN_SRC sql
    select jsonb_set('{"f1":1,"f2":null}', '{f1}', '[2,3,4]') ;
  #+END_SRC

** Extract value

   =-> ->> #> #>>= - Default value extractors

   | *Operator* | *Argument*      | *Result* |
   |----------+---------------+--------|
   | ~->~       | integer, text | jsonb  |
   | ~->>~      | integer, text | text   |
   | ~#>~       | text[]        | jsonb  |
   | ~#>>~      | text[]        | text   |

   #+BEGIN_SRC sql
     select
       x -> 1 as "->"
       , x->> 1 as "->>"
       , x#> '{0, name}' as "->>"
       , x#>> '{0, name}' as "->>"
       from (values ('[{"name": "Joe"}, {"name": "Bob"}]'::jsonb)) as t(x);
     select
       pg_typeof(x -> 1) as "->"
       , pg_typeof(x->> 1) as "->>"
       , pg_typeof(x#> '{0, name}') as "->>"
       , pg_typeof(x#>> '{0, name}') as "->>"
       from (values ('[{"name": "Joe"}, {"name": "Bob"}]'::jsonb)) as t(x) ;
   #+END_SRC

   #+RESULTS:
   | ->              | ->>             | ->>   | ->>  |
   |-----------------+-----------------+-------+------|
   | {"name": "Bob"} | {"name": "Bob"} | "Joe" | Joe  |
   | ->              | ->>             | ->>   | ->>  |
   | jsonb           | text            | jsonb | text |

** Iterators

   =jsonb_array_elements= - populate records from json/jsonb array
   #+BEGIN_SRC sql
     select jsonb_array_elements_text('[1, 2, 3, 4, 5]'::jsonb) itm
   #+END_SRC

   #+RESULTS:
   | itm |
   |-----|
   |   1 |
   |   2 |
   |   3 |
   |   4 |
   |   5 |

   #+BEGIN_SRC sql
     select sum(x::int)
       from (select jsonb_array_elements_text('[1, 2, 3, 4, 5]'::jsonb)) t(x)
   #+END_SRC

   #+RESULTS:
   | sum |
   |-----|
   |  15 |

   =jsonb_each= - populate key/value records from jsonb object
   #+BEGIN_SRC sql
     select *
       from jsonb_each('{"name": "Joe", "family": "Smith"}'::jsonb)
   #+END_SRC

   #+RESULTS:
   | key    | value   |
   |--------+---------|
   | name   | "Joe"   |
   | family | "Smith" |

** Aggregates

   =jsonb_agg= - aggregate tuples into jsonb array
   #+BEGIN_SRC sql
     select jsonb_agg(x)
       from generate_series(1, 5) t(x)
   #+END_SRC

   #+RESULTS:
   | jsonb_agg       |
   |-----------------|
   | [1, 2, 3, 4, 5] |

   =jsonb_object_agg= - aggregate new jsonb object
   #+BEGIN_SRC sql
     select jsonb_pretty(jsonb_object_agg(x, x))
       from generate_series(1,
   #+END_SRC

   #+RESULTS:
   | jsonb_pretty |
   |--------------|
   | {            |
   | "1": 1,      |
   | "2": 2,      |
   | "3": 3,      |
   | "4": 4,      |
   | "5": 5       |
   | }            |

* Jsquery

  [[https://github.com/postgrespro/jsquery][JsQuery]] - json query language with ~GIN~ indexing support

  JSquey not default extension, and need to be installed

  #+BEGIN_SRC sql
    create extension if not exists jsquery;
  #+END_SRC

  JSquey use ~@@~ operator

  #+BEGIN_QUOTE
 ⚡ In PG12 ~jsonpath~ use the same operator ~@@~
    For this reason you should explicitly cast to =::jsqury=

 ⚡ ~JsQuery~ - only as predicate
  #+END_QUOTE

  *Example:*
  #+BEGIN_SRC sql
    select '{"name": "Bob"}'::jsonb @@ ('name = Bob')::jsquery
  #+END_SRC

  #+RESULTS:
  | ?column? |
  |----------|
  | t        |

  #+BEGIN_SRC sql
    select '[{"name": "Bob"}, {"name": "John"}]'::jsonb @@ ('#(name = Bob)')::jsquery
  #+END_SRC

  #+RESULTS:
  | ?column? |
  |----------|
  | t        |


